#### [`repos-official-new`] Terraform Plan 📖`success`

<a href="https://app.terraform.io/app/cdktf-team/prebuilt-providers-official-new/runs/run-NZ2UM3TKVDdwYHxz" target="_blank">Remote Plan Link ↗️</a>

<details><summary>Show Plan</summary>

```tf
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers-official-new/runs/run-NZ2UM3TKVDdwYHxz

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
data.github_team.cdktf-team-cdktf: Reading...
data.github_team.cdktf-team-cdktf: Read complete after 4s [id=6602018]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_actions_secret.cdktf-provider-ad_repo_secret-alert-prs-slack-webhook-url_27B42B43 will be created
  + resource "github_actions_secret" "cdktf-provider-ad_repo_secret-alert-prs-slack-webhook-url_27B42B43" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-ad"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-ad_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_D4F19919 will be created
  + resource "github_actions_secret" "cdktf-provider-ad_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_D4F19919" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-ad"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-ad_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_C3F53483 will be created
  + resource "github_actions_secret" "cdktf-provider-ad_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_C3F53483" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-ad"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-ad_repo_secret-gh-token_3A5BB55D will be created
  + resource "github_actions_secret" "cdktf-provider-ad_repo_secret-gh-token_3A5BB55D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-ad"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-ad_repo_secret-maven-gpg-private-key-passphrase_3261C230 will be created
  + resource "github_actions_secret" "cdktf-provider-ad_repo_secret-maven-gpg-private-key-passphrase_3261C230" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-ad"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-ad_repo_secret-maven-gpg-private-key_D4B79570 will be created
  + resource "github_actions_secret" "cdktf-provider-ad_repo_secret-maven-gpg-private-key_D4B79570" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-ad"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-ad_repo_secret-maven-password_8161FA07 will be created
  + resource "github_actions_secret" "cdktf-provider-ad_repo_secret-maven-password_8161FA07" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-ad"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-ad_repo_secret-maven-staging-profile-id_A4B77CAC will be created
  + resource "github_actions_secret" "cdktf-provider-ad_repo_secret-maven-staging-profile-id_A4B77CAC" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-ad"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-ad_repo_secret-maven-username_FEC3D682 will be created
  + resource "github_actions_secret" "cdktf-provider-ad_repo_secret-maven-username_FEC3D682" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-ad"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-ad_repo_secret-npm-token_361A8BEA will be created
  + resource "github_actions_secret" "cdktf-provider-ad_repo_secret-npm-token_361A8BEA" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-ad"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-ad_repo_secret-nuget-api-key_67BBC68E will be created
  + resource "github_actions_secret" "cdktf-provider-ad_repo_secret-nuget-api-key_67BBC68E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-ad"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-ad_repo_secret-twine-password_E7E53B1D will be created
  + resource "github_actions_secret" "cdktf-provider-ad_repo_secret-twine-password_E7E53B1D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-ad"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-ad_repo_secret-twine-username_FDEA8ED7 will be created
  + resource "github_actions_secret" "cdktf-provider-ad_repo_secret-twine-username_FDEA8ED7" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-ad"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azurestack_repo_secret-alert-prs-slack-webhook-url_3AAD6765 will be created
  + resource "github_actions_secret" "cdktf-provider-azurestack_repo_secret-alert-prs-slack-webhook-url_3AAD6765" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurestack"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azurestack_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_69896F8D will be created
  + resource "github_actions_secret" "cdktf-provider-azurestack_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_69896F8D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurestack"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azurestack_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_4BB7DA4C will be created
  + resource "github_actions_secret" "cdktf-provider-azurestack_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_4BB7DA4C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurestack"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azurestack_repo_secret-gh-token_5904600E will be created
  + resource "github_actions_secret" "cdktf-provider-azurestack_repo_secret-gh-token_5904600E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurestack"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azurestack_repo_secret-maven-gpg-private-key-passphrase_38F97382 will be created
  + resource "github_actions_secret" "cdktf-provider-azurestack_repo_secret-maven-gpg-private-key-passphrase_38F97382" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurestack"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azurestack_repo_secret-maven-gpg-private-key_D0827E5A will be created
  + resource "github_actions_secret" "cdktf-provider-azurestack_repo_secret-maven-gpg-private-key_D0827E5A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurestack"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azurestack_repo_secret-maven-password_2824131C will be created
  + resource "github_actions_secret" "cdktf-provider-azurestack_repo_secret-maven-password_2824131C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurestack"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azurestack_repo_secret-maven-staging-profile-id_1B8D056B will be created
  + resource "github_actions_secret" "cdktf-provider-azurestack_repo_secret-maven-staging-profile-id_1B8D056B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurestack"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azurestack_repo_secret-maven-username_3AF76FA8 will be created
  + resource "github_actions_secret" "cdktf-provider-azurestack_repo_secret-maven-username_3AF76FA8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurestack"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azurestack_repo_secret-npm-token_8C3449E8 will be created
  + resource "github_actions_secret" "cdktf-provider-azurestack_repo_secret-npm-token_8C3449E8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurestack"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azurestack_repo_secret-nuget-api-key_130A5C7B will be created
  + resource "github_actions_secret" "cdktf-provider-azurestack_repo_secret-nuget-api-key_130A5C7B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurestack"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azurestack_repo_secret-twine-password_2AA6C64E will be created
  + resource "github_actions_secret" "cdktf-provider-azurestack_repo_secret-twine-password_2AA6C64E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurestack"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azurestack_repo_secret-twine-username_868BE32B will be created
  + resource "github_actions_secret" "cdktf-provider-azurestack_repo_secret-twine-username_868BE32B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurestack"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-boundary_repo_secret-alert-prs-slack-webhook-url_07110875 will be created
  + resource "github_actions_secret" "cdktf-provider-boundary_repo_secret-alert-prs-slack-webhook-url_07110875" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-boundary"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-boundary_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_86296BA7 will be created
  + resource "github_actions_secret" "cdktf-provider-boundary_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_86296BA7" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-boundary"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-boundary_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_7AC80464 will be created
  + resource "github_actions_secret" "cdktf-provider-boundary_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_7AC80464" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-boundary"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-boundary_repo_secret-gh-token_6ADC2DE5 will be created
  + resource "github_actions_secret" "cdktf-provider-boundary_repo_secret-gh-token_6ADC2DE5" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-boundary"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-boundary_repo_secret-maven-gpg-private-key-passphrase_95613E0D will be created
  + resource "github_actions_secret" "cdktf-provider-boundary_repo_secret-maven-gpg-private-key-passphrase_95613E0D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-boundary"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-boundary_repo_secret-maven-gpg-private-key_16D71AB9 will be created
  + resource "github_actions_secret" "cdktf-provider-boundary_repo_secret-maven-gpg-private-key_16D71AB9" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-boundary"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-boundary_repo_secret-maven-password_AEF5308C will be created
  + resource "github_actions_secret" "cdktf-provider-boundary_repo_secret-maven-password_AEF5308C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-boundary"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-boundary_repo_secret-maven-staging-profile-id_36C2977B will be created
  + resource "github_actions_secret" "cdktf-provider-boundary_repo_secret-maven-staging-profile-id_36C2977B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-boundary"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-boundary_repo_secret-maven-username_F0193805 will be created
  + resource "github_actions_secret" "cdktf-provider-boundary_repo_secret-maven-username_F0193805" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-boundary"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-boundary_repo_secret-npm-token_4E8D698B will be created
  + resource "github_actions_secret" "cdktf-provider-boundary_repo_secret-npm-token_4E8D698B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-boundary"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-boundary_repo_secret-nuget-api-key_F62D37DC will be created
  + resource "github_actions_secret" "cdktf-provider-boundary_repo_secret-nuget-api-key_F62D37DC" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-boundary"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-boundary_repo_secret-twine-password_A811FEB3 will be created
  + resource "github_actions_secret" "cdktf-provider-boundary_repo_secret-twine-password_A811FEB3" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-boundary"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-boundary_repo_secret-twine-username_4CEE6A24 will be created
  + resource "github_actions_secret" "cdktf-provider-boundary_repo_secret-twine-username_4CEE6A24" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-boundary"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-consul_repo_secret-alert-prs-slack-webhook-url_F596EF4F will be created
  + resource "github_actions_secret" "cdktf-provider-consul_repo_secret-alert-prs-slack-webhook-url_F596EF4F" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-consul"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-consul_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_0A475238 will be created
  + resource "github_actions_secret" "cdktf-provider-consul_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_0A475238" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-consul"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-consul_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_52120DCF will be created
  + resource "github_actions_secret" "cdktf-provider-consul_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_52120DCF" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-consul"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-consul_repo_secret-gh-token_46C6E3C0 will be created
  + resource "github_actions_secret" "cdktf-provider-consul_repo_secret-gh-token_46C6E3C0" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-consul"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-consul_repo_secret-maven-gpg-private-key-passphrase_3100F141 will be created
  + resource "github_actions_secret" "cdktf-provider-consul_repo_secret-maven-gpg-private-key-passphrase_3100F141" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-consul"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-consul_repo_secret-maven-gpg-private-key_8DE8FF61 will be created
  + resource "github_actions_secret" "cdktf-provider-consul_repo_secret-maven-gpg-private-key_8DE8FF61" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-consul"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-consul_repo_secret-maven-password_BA8F4065 will be created
  + resource "github_actions_secret" "cdktf-provider-consul_repo_secret-maven-password_BA8F4065" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-consul"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-consul_repo_secret-maven-staging-profile-id_0482DC90 will be created
  + resource "github_actions_secret" "cdktf-provider-consul_repo_secret-maven-staging-profile-id_0482DC90" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-consul"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-consul_repo_secret-maven-username_4960F452 will be created
  + resource "github_actions_secret" "cdktf-provider-consul_repo_secret-maven-username_4960F452" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-consul"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-consul_repo_secret-npm-token_EFDB343E will be created
  + resource "github_actions_secret" "cdktf-provider-consul_repo_secret-npm-token_EFDB343E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-consul"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-consul_repo_secret-nuget-api-key_88092B18 will be created
  + resource "github_actions_secret" "cdktf-provider-consul_repo_secret-nuget-api-key_88092B18" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-consul"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-consul_repo_secret-twine-password_80AA85AF will be created
  + resource "github_actions_secret" "cdktf-provider-consul_repo_secret-twine-password_80AA85AF" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-consul"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-consul_repo_secret-twine-username_45DEB69F will be created
  + resource "github_actions_secret" "cdktf-provider-consul_repo_secret-twine-username_45DEB69F" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-consul"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-dns_repo_secret-alert-prs-slack-webhook-url_18C6A4F8 will be created
  + resource "github_actions_secret" "cdktf-provider-dns_repo_secret-alert-prs-slack-webhook-url_18C6A4F8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-dns_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_13EB1DB5 will be created
  + resource "github_actions_secret" "cdktf-provider-dns_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_13EB1DB5" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-dns_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_6A5FC7D9 will be created
  + resource "github_actions_secret" "cdktf-provider-dns_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_6A5FC7D9" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-dns_repo_secret-gh-token_4ECE74D2 will be created
  + resource "github_actions_secret" "cdktf-provider-dns_repo_secret-gh-token_4ECE74D2" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-dns_repo_secret-maven-gpg-private-key-passphrase_E904EE8A will be created
  + resource "github_actions_secret" "cdktf-provider-dns_repo_secret-maven-gpg-private-key-passphrase_E904EE8A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-dns_repo_secret-maven-gpg-private-key_557230F0 will be created
  + resource "github_actions_secret" "cdktf-provider-dns_repo_secret-maven-gpg-private-key_557230F0" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-dns_repo_secret-maven-password_31CC1FEC will be created
  + resource "github_actions_secret" "cdktf-provider-dns_repo_secret-maven-password_31CC1FEC" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-dns_repo_secret-maven-staging-profile-id_5AA32737 will be created
  + resource "github_actions_secret" "cdktf-provider-dns_repo_secret-maven-staging-profile-id_5AA32737" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-dns_repo_secret-maven-username_C7D1EECD will be created
  + resource "github_actions_secret" "cdktf-provider-dns_repo_secret-maven-username_C7D1EECD" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-dns_repo_secret-npm-token_3E6DF1BE will be created
  + resource "github_actions_secret" "cdktf-provider-dns_repo_secret-npm-token_3E6DF1BE" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-dns_repo_secret-nuget-api-key_09403616 will be created
  + resource "github_actions_secret" "cdktf-provider-dns_repo_secret-nuget-api-key_09403616" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-dns_repo_secret-twine-password_0BACA30E will be created
  + resource "github_actions_secret" "cdktf-provider-dns_repo_secret-twine-password_0BACA30E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-dns_repo_secret-twine-username_E43DF3B2 will be created
  + resource "github_actions_secret" "cdktf-provider-dns_repo_secret-twine-username_E43DF3B2" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-googleworkspace_repo_secret-alert-prs-slack-webhook-url_352EF575 will be created
  + resource "github_actions_secret" "cdktf-provider-googleworkspace_repo_secret-alert-prs-slack-webhook-url_352EF575" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-googleworkspace"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-googleworkspace_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_C7BB74D0 will be created
  + resource "github_actions_secret" "cdktf-provider-googleworkspace_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_C7BB74D0" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-googleworkspace"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-googleworkspace_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_BB1F9515 will be created
  + resource "github_actions_secret" "cdktf-provider-googleworkspace_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_BB1F9515" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-googleworkspace"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-googleworkspace_repo_secret-gh-token_BDF5D1C2 will be created
  + resource "github_actions_secret" "cdktf-provider-googleworkspace_repo_secret-gh-token_BDF5D1C2" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-googleworkspace"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-googleworkspace_repo_secret-maven-gpg-private-key-passphrase_7E438643 will be created
  + resource "github_actions_secret" "cdktf-provider-googleworkspace_repo_secret-maven-gpg-private-key-passphrase_7E438643" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-googleworkspace"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-googleworkspace_repo_secret-maven-gpg-private-key_6C8A60D1 will be created
  + resource "github_actions_secret" "cdktf-provider-googleworkspace_repo_secret-maven-gpg-private-key_6C8A60D1" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-googleworkspace"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-googleworkspace_repo_secret-maven-password_5F4AF6CA will be created
  + resource "github_actions_secret" "cdktf-provider-googleworkspace_repo_secret-maven-password_5F4AF6CA" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-googleworkspace"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-googleworkspace_repo_secret-maven-staging-profile-id_BCBE00F3 will be created
  + resource "github_actions_secret" "cdktf-provider-googleworkspace_repo_secret-maven-staging-profile-id_BCBE00F3" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-googleworkspace"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-googleworkspace_repo_secret-maven-username_C30215EC will be created
  + resource "github_actions_secret" "cdktf-provider-googleworkspace_repo_secret-maven-username_C30215EC" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-googleworkspace"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-googleworkspace_repo_secret-npm-token_DBFE6AAF will be created
  + resource "github_actions_secret" "cdktf-provider-googleworkspace_repo_secret-npm-token_DBFE6AAF" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-googleworkspace"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-googleworkspace_repo_secret-nuget-api-key_82F5D563 will be created
  + resource "github_actions_secret" "cdktf-provider-googleworkspace_repo_secret-nuget-api-key_82F5D563" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-googleworkspace"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-googleworkspace_repo_secret-twine-password_4202D3B0 will be created
  + resource "github_actions_secret" "cdktf-provider-googleworkspace_repo_secret-twine-password_4202D3B0" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-googleworkspace"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-googleworkspace_repo_secret-twine-username_9901AA3B will be created
  + resource "github_actions_secret" "cdktf-provider-googleworkspace_repo_secret-twine-username_9901AA3B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-googleworkspace"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-hcp_repo_secret-alert-prs-slack-webhook-url_2A3AF15A will be created
  + resource "github_actions_secret" "cdktf-provider-hcp_repo_secret-alert-prs-slack-webhook-url_2A3AF15A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcp"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-hcp_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_2D0FF12B will be created
  + resource "github_actions_secret" "cdktf-provider-hcp_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_2D0FF12B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcp"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-hcp_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_6C03A75F will be created
  + resource "github_actions_secret" "cdktf-provider-hcp_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_6C03A75F" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcp"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-hcp_repo_secret-gh-token_33FED2D5 will be created
  + resource "github_actions_secret" "cdktf-provider-hcp_repo_secret-gh-token_33FED2D5" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcp"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-hcp_repo_secret-maven-gpg-private-key-passphrase_12CFF228 will be created
  + resource "github_actions_secret" "cdktf-provider-hcp_repo_secret-maven-gpg-private-key-passphrase_12CFF228" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcp"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-hcp_repo_secret-maven-gpg-private-key_EAB4AA00 will be created
  + resource "github_actions_secret" "cdktf-provider-hcp_repo_secret-maven-gpg-private-key_EAB4AA00" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcp"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-hcp_repo_secret-maven-password_6EB0CAFC will be created
  + resource "github_actions_secret" "cdktf-provider-hcp_repo_secret-maven-password_6EB0CAFC" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcp"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-hcp_repo_secret-maven-staging-profile-id_CB4723FB will be created
  + resource "github_actions_secret" "cdktf-provider-hcp_repo_secret-maven-staging-profile-id_CB4723FB" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcp"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-hcp_repo_secret-maven-username_54C1F895 will be created
  + resource "github_actions_secret" "cdktf-provider-hcp_repo_secret-maven-username_54C1F895" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcp"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-hcp_repo_secret-npm-token_784C5AF6 will be created
  + resource "github_actions_secret" "cdktf-provider-hcp_repo_secret-npm-token_784C5AF6" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcp"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-hcp_repo_secret-nuget-api-key_AC79AB1A will be created
  + resource "github_actions_secret" "cdktf-provider-hcp_repo_secret-nuget-api-key_AC79AB1A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcp"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-hcp_repo_secret-twine-password_D2700318 will be created
  + resource "github_actions_secret" "cdktf-provider-hcp_repo_secret-twine-password_D2700318" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcp"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-hcp_repo_secret-twine-username_24984759 will be created
  + resource "github_actions_secret" "cdktf-provider-hcp_repo_secret-twine-username_24984759" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcp"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-hcs_repo_secret-alert-prs-slack-webhook-url_DB19A3CB will be created
  + resource "github_actions_secret" "cdktf-provider-hcs_repo_secret-alert-prs-slack-webhook-url_DB19A3CB" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcs"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-hcs_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_8E0613F3 will be created
  + resource "github_actions_secret" "cdktf-provider-hcs_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_8E0613F3" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcs"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-hcs_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_9BB5F89C will be created
  + resource "github_actions_secret" "cdktf-provider-hcs_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_9BB5F89C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcs"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-hcs_repo_secret-gh-token_E6725005 will be created
  + resource "github_actions_secret" "cdktf-provider-hcs_repo_secret-gh-token_E6725005" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcs"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-hcs_repo_secret-maven-gpg-private-key-passphrase_854FD113 will be created
  + resource "github_actions_secret" "cdktf-provider-hcs_repo_secret-maven-gpg-private-key-passphrase_854FD113" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcs"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-hcs_repo_secret-maven-gpg-private-key_5E3DC161 will be created
  + resource "github_actions_secret" "cdktf-provider-hcs_repo_secret-maven-gpg-private-key_5E3DC161" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcs"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-hcs_repo_secret-maven-password_0BCC22EE will be created
  + resource "github_actions_secret" "cdktf-provider-hcs_repo_secret-maven-password_0BCC22EE" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcs"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-hcs_repo_secret-maven-staging-profile-id_19AE564F will be created
  + resource "github_actions_secret" "cdktf-provider-hcs_repo_secret-maven-staging-profile-id_19AE564F" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcs"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-hcs_repo_secret-maven-username_D2CD810D will be created
  + resource "github_actions_secret" "cdktf-provider-hcs_repo_secret-maven-username_D2CD810D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcs"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-hcs_repo_secret-npm-token_FC5EB584 will be created
  + resource "github_actions_secret" "cdktf-provider-hcs_repo_secret-npm-token_FC5EB584" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcs"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-hcs_repo_secret-nuget-api-key_1C5EED9D will be created
  + resource "github_actions_secret" "cdktf-provider-hcs_repo_secret-nuget-api-key_1C5EED9D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcs"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-hcs_repo_secret-twine-password_1E63875A will be created
  + resource "github_actions_secret" "cdktf-provider-hcs_repo_secret-twine-password_1E63875A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcs"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-hcs_repo_secret-twine-username_6353CA65 will be created
  + resource "github_actions_secret" "cdktf-provider-hcs_repo_secret-twine-username_6353CA65" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hcs"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-http_repo_secret-alert-prs-slack-webhook-url_36A7DF5D will be created
  + resource "github_actions_secret" "cdktf-provider-http_repo_secret-alert-prs-slack-webhook-url_36A7DF5D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-http"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-http_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_3F92695D will be created
  + resource "github_actions_secret" "cdktf-provider-http_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_3F92695D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-http"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-http_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_5ECB4895 will be created
  + resource "github_actions_secret" "cdktf-provider-http_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_5ECB4895" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-http"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-http_repo_secret-gh-token_6A0C957E will be created
  + resource "github_actions_secret" "cdktf-provider-http_repo_secret-gh-token_6A0C957E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-http"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-http_repo_secret-maven-gpg-private-key-passphrase_752286DF will be created
  + resource "github_actions_secret" "cdktf-provider-http_repo_secret-maven-gpg-private-key-passphrase_752286DF" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-http"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-http_repo_secret-maven-gpg-private-key_2E35F915 will be created
  + resource "github_actions_secret" "cdktf-provider-http_repo_secret-maven-gpg-private-key_2E35F915" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-http"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-http_repo_secret-maven-password_CEFF4E3F will be created
  + resource "github_actions_secret" "cdktf-provider-http_repo_secret-maven-password_CEFF4E3F" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-http"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-http_repo_secret-maven-staging-profile-id_17DF2C16 will be created
  + resource "github_actions_secret" "cdktf-provider-http_repo_secret-maven-staging-profile-id_17DF2C16" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-http"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-http_repo_secret-maven-username_C22F3D5C will be created
  + resource "github_actions_secret" "cdktf-provider-http_repo_secret-maven-username_C22F3D5C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-http"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-http_repo_secret-npm-token_61575784 will be created
  + resource "github_actions_secret" "cdktf-provider-http_repo_secret-npm-token_61575784" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-http"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-http_repo_secret-nuget-api-key_F1E662AF will be created
  + resource "github_actions_secret" "cdktf-provider-http_repo_secret-nuget-api-key_F1E662AF" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-http"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-http_repo_secret-twine-password_6B51E0D0 will be created
  + resource "github_actions_secret" "cdktf-provider-http_repo_secret-twine-password_6B51E0D0" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-http"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-http_repo_secret-twine-username_5A7A81AC will be created
  + resource "github_actions_secret" "cdktf-provider-http_repo_secret-twine-username_5A7A81AC" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-http"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-nomad_repo_secret-alert-prs-slack-webhook-url_C608766F will be created
  + resource "github_actions_secret" "cdktf-provider-nomad_repo_secret-alert-prs-slack-webhook-url_C608766F" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-nomad"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-nomad_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_CD1BD6D5 will be created
  + resource "github_actions_secret" "cdktf-provider-nomad_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_CD1BD6D5" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-nomad"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-nomad_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_85BBE7DB will be created
  + resource "github_actions_secret" "cdktf-provider-nomad_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_85BBE7DB" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-nomad"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-nomad_repo_secret-gh-token_7B497091 will be created
  + resource "github_actions_secret" "cdktf-provider-nomad_repo_secret-gh-token_7B497091" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-nomad"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-nomad_repo_secret-maven-gpg-private-key-passphrase_92765C79 will be created
  + resource "github_actions_secret" "cdktf-provider-nomad_repo_secret-maven-gpg-private-key-passphrase_92765C79" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-nomad"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-nomad_repo_secret-maven-gpg-private-key_579FD942 will be created
  + resource "github_actions_secret" "cdktf-provider-nomad_repo_secret-maven-gpg-private-key_579FD942" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-nomad"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-nomad_repo_secret-maven-password_CF630EBE will be created
  + resource "github_actions_secret" "cdktf-provider-nomad_repo_secret-maven-password_CF630EBE" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-nomad"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-nomad_repo_secret-maven-staging-profile-id_3509C0CF will be created
  + resource "github_actions_secret" "cdktf-provider-nomad_repo_secret-maven-staging-profile-id_3509C0CF" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-nomad"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-nomad_repo_secret-maven-username_F2AA1254 will be created
  + resource "github_actions_secret" "cdktf-provider-nomad_repo_secret-maven-username_F2AA1254" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-nomad"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-nomad_repo_secret-npm-token_33FE3E49 will be created
  + resource "github_actions_secret" "cdktf-provider-nomad_repo_secret-npm-token_33FE3E49" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-nomad"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-nomad_repo_secret-nuget-api-key_2112FF26 will be created
  + resource "github_actions_secret" "cdktf-provider-nomad_repo_secret-nuget-api-key_2112FF26" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-nomad"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-nomad_repo_secret-twine-password_6E18466C will be created
  + resource "github_actions_secret" "cdktf-provider-nomad_repo_secret-twine-password_6E18466C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-nomad"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-nomad_repo_secret-twine-username_70C2E60A will be created
  + resource "github_actions_secret" "cdktf-provider-nomad_repo_secret-twine-username_70C2E60A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-no...
```

</details>

*Pusher: @DanielMSchmidt, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*